MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAS176/mcu.h
extern volatile __C2RXF11bits_t C2RXF11bits __asm__ ("C2RXF11") __attribute__((section("sfrs"), address(0xBF8811F0)));
extern volatile uint32_t        C2RXF11CLR __attribute__((section("sfrs"),address(0xBF8811F4)));
extern volatile uint32_t        C2RXF11SET __attribute__((section("sfrs"),address(0xBF8811F8)));
extern volatile uint32_t        C2RXF11INV __attribute__((section("sfrs"),address(0xBF8811FC)));
#define C2RXF12 C2RXF12
extern volatile uint32_t   C2RXF12 __attribute__((section("sfrs"), address(0xBF881200)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF12bits_t;
extern volatile __C2RXF12bits_t C2RXF12bits __asm__ ("C2RXF12") __attribute__((section("sfrs"), address(0xBF881200)));
extern volatile uint32_t        C2RXF12CLR __attribute__((section("sfrs"),address(0xBF881204)));
extern volatile uint32_t        C2RXF12SET __attribute__((section("sfrs"),address(0xBF881208)));
extern volatile uint32_t        C2RXF12INV __attribute__((section("sfrs"),address(0xBF88120C)));
#define C2RXF13 C2RXF13
extern volatile uint32_t   C2RXF13 __attribute__((section("sfrs"), address(0xBF881210)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF13bits_t;
extern volatile __C2RXF13bits_t C2RXF13bits __asm__ ("C2RXF13") __attribute__((section("sfrs"), address(0xBF881210)));
extern volatile uint32_t        C2RXF13CLR __attribute__((section("sfrs"),address(0xBF881214)));
extern volatile uint32_t        C2RXF13SET __attribute__((section("sfrs"),address(0xBF881218)));
extern volatile uint32_t        C2RXF13INV __attribute__((section("sfrs"),address(0xBF88121C)));
#define C2RXF14 C2RXF14
extern volatile uint32_t   C2RXF14 __attribute__((section("sfrs"), address(0xBF881220)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF14bits_t;
extern volatile __C2RXF14bits_t C2RXF14bits __asm__ ("C2RXF14") __attribute__((section("sfrs"), address(0xBF881220)));
extern volatile uint32_t        C2RXF14CLR __attribute__((section("sfrs"),address(0xBF881224)));
extern volatile uint32_t        C2RXF14SET __attribute__((section("sfrs"),address(0xBF881228)));
extern volatile uint32_t        C2RXF14INV __attribute__((section("sfrs"),address(0xBF88122C)));
#define C2RXF15 C2RXF15
extern volatile uint32_t   C2RXF15 __attribute__((section("sfrs"), address(0xBF881230)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF15bits_t;
extern volatile __C2RXF15bits_t C2RXF15bits __asm__ ("C2RXF15") __attribute__((section("sfrs"), address(0xBF881230)));
extern volatile uint32_t        C2RXF15CLR __attribute__((section("sfrs"),address(0xBF881234)));
extern volatile uint32_t        C2RXF15SET __attribute__((section("sfrs"),address(0xBF881238)));
extern volatile uint32_t        C2RXF15INV __attribute__((section("sfrs"),address(0xBF88123C)));
#define C2RXF16 C2RXF16
extern volatile uint32_t   C2RXF16 __attribute__((section("sfrs"), address(0xBF881240)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF16bits_t;
extern volatile __C2RXF16bits_t C2RXF16bits __asm__ ("C2RXF16") __attribute__((section("sfrs"), address(0xBF881240)));
extern volatile uint32_t        C2RXF16CLR __attribute__((section("sfrs"),address(0xBF881244)));
extern volatile uint32_t        C2RXF16SET __attribute__((section("sfrs"),address(0xBF881248)));
extern volatile uint32_t        C2RXF16INV __attribute__((section("sfrs"),address(0xBF88124C)));
#define C2RXF17 C2RXF17
extern volatile uint32_t   C2RXF17 __attribute__((section("sfrs"), address(0xBF881250)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF17bits_t;
extern volatile __C2RXF17bits_t C2RXF17bits __asm__ ("C2RXF17") __attribute__((section("sfrs"), address(0xBF881250)));
extern volatile uint32_t        C2RXF17CLR __attribute__((section("sfrs"),address(0xBF881254)));
extern volatile uint32_t        C2RXF17SET __attribute__((section("sfrs"),address(0xBF881258)));
extern volatile uint32_t        C2RXF17INV __attribute__((section("sfrs"),address(0xBF88125C)));
#define C2RXF18 C2RXF18
extern volatile uint32_t   C2RXF18 __attribute__((section("sfrs"), address(0xBF881260)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF18bits_t;
extern volatile __C2RXF18bits_t C2RXF18bits __asm__ ("C2RXF18") __attribute__((section("sfrs"), address(0xBF881260)));
extern volatile uint32_t        C2RXF18CLR __attribute__((section("sfrs"),address(0xBF881264)));
extern volatile uint32_t        C2RXF18SET __attribute__((section("sfrs"),address(0xBF881268)));
extern volatile uint32_t        C2RXF18INV __attribute__((section("sfrs"),address(0xBF88126C)));
#define C2RXF19 C2RXF19
extern volatile uint32_t   C2RXF19 __attribute__((section("sfrs"), address(0xBF881270)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF19bits_t;
extern volatile __C2RXF19bits_t C2RXF19bits __asm__ ("C2RXF19") __attribute__((section("sfrs"), address(0xBF881270)));
extern volatile uint32_t        C2RXF19CLR __attribute__((section("sfrs"),address(0xBF881274)));
extern volatile uint32_t        C2RXF19SET __attribute__((section("sfrs"),address(0xBF881278)));
extern volatile uint32_t        C2RXF19INV __attribute__((section("sfrs"),address(0xBF88127C)));
#define C2RXF20 C2RXF20
extern volatile uint32_t   C2RXF20 __attribute__((section("sfrs"), address(0xBF881280)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF20bits_t;
extern volatile __C2RXF20bits_t C2RXF20bits __asm__ ("C2RXF20") __attribute__((section("sfrs"), address(0xBF881280)));
extern volatile uint32_t        C2RXF20CLR __attribute__((section("sfrs"),address(0xBF881284)));
extern volatile uint32_t        C2RXF20SET __attribute__((section("sfrs"),address(0xBF881288)));
extern volatile uint32_t        C2RXF20INV __attribute__((section("sfrs"),address(0xBF88128C)));
#define C2RXF21 C2RXF21
extern volatile uint32_t   C2RXF21 __attribute__((section("sfrs"), address(0xBF881290)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF21bits_t;
extern volatile __C2RXF21bits_t C2RXF21bits __asm__ ("C2RXF21") __attribute__((section("sfrs"), address(0xBF881290)));
extern volatile uint32_t        C2RXF21CLR __attribute__((section("sfrs"),address(0xBF881294)));
extern volatile uint32_t        C2RXF21SET __attribute__((section("sfrs"),address(0xBF881298)));
extern volatile uint32_t        C2RXF21INV __attribute__((section("sfrs"),address(0xBF88129C)));
#define C2RXF22 C2RXF22
extern volatile uint32_t   C2RXF22 __attribute__((section("sfrs"), address(0xBF8812A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF22bits_t;
extern volatile __C2RXF22bits_t C2RXF22bits __asm__ ("C2RXF22") __attribute__((section("sfrs"), address(0xBF8812A0)));
extern volatile uint32_t        C2RXF22CLR __attribute__((section("sfrs"),address(0xBF8812A4)));
extern volatile uint32_t        C2RXF22SET __attribute__((section("sfrs"),address(0xBF8812A8)));
extern volatile uint32_t        C2RXF22INV __attribute__((section("sfrs"),address(0xBF8812AC)));
#define C2RXF23 C2RXF23
extern volatile uint32_t   C2RXF23 __attribute__((section("sfrs"), address(0xBF8812B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF23bits_t;
extern volatile __C2RXF23bits_t C2RXF23bits __asm__ ("C2RXF23") __attribute__((section("sfrs"), address(0xBF8812B0)));
extern volatile uint32_t        C2RXF23CLR __attribute__((section("sfrs"),address(0xBF8812B4)));
extern volatile uint32_t        C2RXF23SET __attribute__((section("sfrs"),address(0xBF8812B8)));
extern volatile uint32_t        C2RXF23INV __attribute__((section("sfrs"),address(0xBF8812BC)));
#define C2RXF24 C2RXF24
extern volatile uint32_t   C2RXF24 __attribute__((section("sfrs"), address(0xBF8812C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF24bits_t;
