MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAS176/mcu.h
extern volatile __C2RXF24bits_t C2RXF24bits __asm__ ("C2RXF24") __attribute__((section("sfrs"), address(0xBF8812C0)));
extern volatile uint32_t        C2RXF24CLR __attribute__((section("sfrs"),address(0xBF8812C4)));
extern volatile uint32_t        C2RXF24SET __attribute__((section("sfrs"),address(0xBF8812C8)));
extern volatile uint32_t        C2RXF24INV __attribute__((section("sfrs"),address(0xBF8812CC)));
#define C2RXF25 C2RXF25
extern volatile uint32_t   C2RXF25 __attribute__((section("sfrs"), address(0xBF8812D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF25bits_t;
extern volatile __C2RXF25bits_t C2RXF25bits __asm__ ("C2RXF25") __attribute__((section("sfrs"), address(0xBF8812D0)));
extern volatile uint32_t        C2RXF25CLR __attribute__((section("sfrs"),address(0xBF8812D4)));
extern volatile uint32_t        C2RXF25SET __attribute__((section("sfrs"),address(0xBF8812D8)));
extern volatile uint32_t        C2RXF25INV __attribute__((section("sfrs"),address(0xBF8812DC)));
#define C2RXF26 C2RXF26
extern volatile uint32_t   C2RXF26 __attribute__((section("sfrs"), address(0xBF8812E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF26bits_t;
extern volatile __C2RXF26bits_t C2RXF26bits __asm__ ("C2RXF26") __attribute__((section("sfrs"), address(0xBF8812E0)));
extern volatile uint32_t        C2RXF26CLR __attribute__((section("sfrs"),address(0xBF8812E4)));
extern volatile uint32_t        C2RXF26SET __attribute__((section("sfrs"),address(0xBF8812E8)));
extern volatile uint32_t        C2RXF26INV __attribute__((section("sfrs"),address(0xBF8812EC)));
#define C2RXF27 C2RXF27
extern volatile uint32_t   C2RXF27 __attribute__((section("sfrs"), address(0xBF8812F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF27bits_t;
extern volatile __C2RXF27bits_t C2RXF27bits __asm__ ("C2RXF27") __attribute__((section("sfrs"), address(0xBF8812F0)));
extern volatile uint32_t        C2RXF27CLR __attribute__((section("sfrs"),address(0xBF8812F4)));
extern volatile uint32_t        C2RXF27SET __attribute__((section("sfrs"),address(0xBF8812F8)));
extern volatile uint32_t        C2RXF27INV __attribute__((section("sfrs"),address(0xBF8812FC)));
#define C2RXF28 C2RXF28
extern volatile uint32_t   C2RXF28 __attribute__((section("sfrs"), address(0xBF881300)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF28bits_t;
extern volatile __C2RXF28bits_t C2RXF28bits __asm__ ("C2RXF28") __attribute__((section("sfrs"), address(0xBF881300)));
extern volatile uint32_t        C2RXF28CLR __attribute__((section("sfrs"),address(0xBF881304)));
extern volatile uint32_t        C2RXF28SET __attribute__((section("sfrs"),address(0xBF881308)));
extern volatile uint32_t        C2RXF28INV __attribute__((section("sfrs"),address(0xBF88130C)));
#define C2RXF29 C2RXF29
extern volatile uint32_t   C2RXF29 __attribute__((section("sfrs"), address(0xBF881310)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF29bits_t;
extern volatile __C2RXF29bits_t C2RXF29bits __asm__ ("C2RXF29") __attribute__((section("sfrs"), address(0xBF881310)));
extern volatile uint32_t        C2RXF29CLR __attribute__((section("sfrs"),address(0xBF881314)));
extern volatile uint32_t        C2RXF29SET __attribute__((section("sfrs"),address(0xBF881318)));
extern volatile uint32_t        C2RXF29INV __attribute__((section("sfrs"),address(0xBF88131C)));
#define C2RXF30 C2RXF30
extern volatile uint32_t   C2RXF30 __attribute__((section("sfrs"), address(0xBF881320)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF30bits_t;
extern volatile __C2RXF30bits_t C2RXF30bits __asm__ ("C2RXF30") __attribute__((section("sfrs"), address(0xBF881320)));
extern volatile uint32_t        C2RXF30CLR __attribute__((section("sfrs"),address(0xBF881324)));
extern volatile uint32_t        C2RXF30SET __attribute__((section("sfrs"),address(0xBF881328)));
extern volatile uint32_t        C2RXF30INV __attribute__((section("sfrs"),address(0xBF88132C)));
#define C2RXF31 C2RXF31
extern volatile uint32_t   C2RXF31 __attribute__((section("sfrs"), address(0xBF881330)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C2RXF31bits_t;
extern volatile __C2RXF31bits_t C2RXF31bits __asm__ ("C2RXF31") __attribute__((section("sfrs"), address(0xBF881330)));
extern volatile uint32_t        C2RXF31CLR __attribute__((section("sfrs"),address(0xBF881334)));
extern volatile uint32_t        C2RXF31SET __attribute__((section("sfrs"),address(0xBF881338)));
extern volatile uint32_t        C2RXF31INV __attribute__((section("sfrs"),address(0xBF88133C)));
#define C2FIFOBA C2FIFOBA
extern volatile uint32_t   C2FIFOBA __attribute__((section("sfrs"), address(0xBF881340)));
extern volatile uint32_t        C2FIFOBACLR __attribute__((section("sfrs"),address(0xBF881344)));
extern volatile uint32_t        C2FIFOBASET __attribute__((section("sfrs"),address(0xBF881348)));
extern volatile uint32_t        C2FIFOBAINV __attribute__((section("sfrs"),address(0xBF88134C)));
#define C2FIFOCON0 C2FIFOCON0
extern volatile uint32_t   C2FIFOCON0 __attribute__((section("sfrs"), address(0xBF881350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON0bits_t;
extern volatile __C2FIFOCON0bits_t C2FIFOCON0bits __asm__ ("C2FIFOCON0") __attribute__((section("sfrs"), address(0xBF881350)));
extern volatile uint32_t        C2FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF881354)));
extern volatile uint32_t        C2FIFOCON0SET __attribute__((section("sfrs"),address(0xBF881358)));
extern volatile uint32_t        C2FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88135C)));
#define C2FIFOINT0 C2FIFOINT0
extern volatile uint32_t   C2FIFOINT0 __attribute__((section("sfrs"), address(0xBF881360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT0bits_t;
extern volatile __C2FIFOINT0bits_t C2FIFOINT0bits __asm__ ("C2FIFOINT0") __attribute__((section("sfrs"), address(0xBF881360)));
extern volatile uint32_t        C2FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF881364)));
extern volatile uint32_t        C2FIFOINT0SET __attribute__((section("sfrs"),address(0xBF881368)));
extern volatile uint32_t        C2FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88136C)));
#define C2FIFOUA0 C2FIFOUA0
extern volatile uint32_t   C2FIFOUA0 __attribute__((section("sfrs"), address(0xBF881370)));
extern volatile uint32_t        C2FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF881374)));
extern volatile uint32_t        C2FIFOUA0SET __attribute__((section("sfrs"),address(0xBF881378)));
extern volatile uint32_t        C2FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88137C)));
#define C2FIFOCI0 C2FIFOCI0
extern volatile uint32_t   C2FIFOCI0 __attribute__((section("sfrs"), address(0xBF881380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI0bits_t;
extern volatile __C2FIFOCI0bits_t C2FIFOCI0bits __asm__ ("C2FIFOCI0") __attribute__((section("sfrs"), address(0xBF881380)));
extern volatile uint32_t        C2FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF881384)));
extern volatile uint32_t        C2FIFOCI0SET __attribute__((section("sfrs"),address(0xBF881388)));
extern volatile uint32_t        C2FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88138C)));
#define C2FIFOCON1 C2FIFOCON1
extern volatile uint32_t   C2FIFOCON1 __attribute__((section("sfrs"), address(0xBF881390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON1bits_t;
extern volatile __C2FIFOCON1bits_t C2FIFOCON1bits __asm__ ("C2FIFOCON1") __attribute__((section("sfrs"), address(0xBF881390)));
extern volatile uint32_t        C2FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF881394)));
extern volatile uint32_t        C2FIFOCON1SET __attribute__((section("sfrs"),address(0xBF881398)));
extern volatile uint32_t        C2FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88139C)));
#define C2FIFOINT1 C2FIFOINT1
extern volatile uint32_t   C2FIFOINT1 __attribute__((section("sfrs"), address(0xBF8813A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT1bits_t;
